BasaDip/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BasaDip/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BasaDip/src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BasaDip/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BasaDip/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BasaDip/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

BasaDip/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
    Возврат;
КонецЕсли;

	Сумма = ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.СотрудникТекущегоПользователя;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Проведен Тогда
		Рег = РегистрыНакопления.Товары;
		НаборТовары  = Рег.СоздатьНаборЗаписей();
		НаборТовары.Отбор.Регистратор.Установить(Ссылка);
		НаборТовары.Записать();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип КАК НоменклатураТип,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Количество) КАК Количество,
	               |	СУММА(РеализацияТоваровИУслугТоварыИУслуги.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ_НоменклатураДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	               |ГДЕ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура.Тип
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыОстатки.Номенклатура КАК НоменклатураОстаток,
	               |	СУММА(ТоварыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	               |	СУММА(ТоварыОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ПОМЕСТИТЬ ВТ_ОстаткиНоменклатуры
	               |ИЗ
	               |	РегистрНакопления.Товары.Остатки(&Дата, ) КАК ТоварыОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыОстатки.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НоменклатураДокумента.НоменклатураТип КАК НоменклатураТип,
	               |	ВТ_НоменклатураДокумента.Номенклатура КАК Номенклатура,
	               |	ВТ_НоменклатураДокумента.Количество КАК Количество,
	               |	ВТ_НоменклатураДокумента.Сумма КАК Сумма,
	               |	ВТ_ОстаткиНоменклатуры.НоменклатураОстаток КАК НоменклатураОстаток,
	               |	ВТ_ОстаткиНоменклатуры.КоличествоОстаток КАК КоличествоОстаток,
	               |	ВТ_ОстаткиНоменклатуры.СуммаОстаток КАК СуммаОстаток
	               |ПОМЕСТИТЬ ВТ_Результат
	               |ИЗ
	               |	ВТ_НоменклатураДокумента КАК ВТ_НоменклатураДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНоменклатуры КАК ВТ_ОстаткиНоменклатуры
	               |		ПО ВТ_НоменклатураДокумента.Номенклатура = ВТ_ОстаткиНоменклатуры.НоменклатураОстаток";
	
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы.Получить(2).ПолучитьДанные().Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Для каждого Стр Из ТоварыИУслуги Цикл
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = (СтрШаблон("Товара ""%1"" недостаточно в количестве: %2", Стр.Номенклатура, Стр.Количество));
			Сообщение.Сообщить();
		КонецЦикла;
		Отказ = Истина;
	КонецЕсли;
	
	Движения.Товары.Записывать = Истина;
	Движения.Доходы.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.НоменклатураТип = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
			
			Если Выборка.КоличествоОстаток = 0 Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = (СтрШаблон("Товара ""%1"" недостаточно в количестве: %2", Выборка.Номенклатура, Выборка.Количество));
				Сообщение.Сообщить();
				Отказ = Истина;
				
			ИначеЕсли Выборка.КоличествоОстаток - Выборка.Количество < 0  Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = (СтрШаблон("Товара ""%1"" недостаточно в количестве: %2", Выборка.Номенклатура, (-(Выборка.КоличествоОстаток - Выборка.Количество))));
				Сообщение.Сообщить();
				Отказ = Истина;
				
			Иначе
				Если Выборка.КоличествоОстаток = Выборка.Количество Тогда
					СуммаКСписанию = Выборка.СуммаОстаток;
				Иначе
					СуммаЗаЕдиницу = Выборка.СуммаОстаток / Выборка.КоличествоОстаток;
					СуммаКСписанию = СуммаЗаЕдиницу * Выборка.Количество;
				КонецЕсли;
				
				Движение = Движения.Товары.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура  = Выборка.Номенклатура;
				Движение.Количество = Выборка.Количество;
				Движение.Сумма = СуммаКСписанию;
				
				Движение = Движения.Расходы.Добавить();
				Движение.Период = Дата;
				Движение.Номенклатура  = Выборка.Номенклатура;
				Движение.Сумма = СуммаКСписанию;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Движение = Движения.Доходы.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура  = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Покупатель;
		Движение.Сумма = Сумма;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
